---
kind: type
id: T:Autodesk.Revit.DB.AssemblyDifferenceNamingCategory
source: html/cac67198-6888-6c9c-bc0b-f11cf9da2f77.htm
---
# Autodesk.Revit.DB.AssemblyDifferenceNamingCategory

The two assemblies being compared have different naming categories

## Syntax (C#)
```csharp
public class AssemblyDifferenceNamingCategory : AssemblyDifference
```